cf_billing/Documents/энргСоглашениеОРаспределенииСверхнормативногоОДН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>энргСоглашениеОРаспределенииСверхнормативногоОДН</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.энргИсторияСоглашенийОРаспределенииСверхнормативногоОДН</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФактическогоСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РаспределятьПолностью</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/Documents/энргСоглашениеОРаспределенииСверхнормативногоОДН/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Если ДополнительныеСвойства.свойство("ВосстановлениеПоследовательности") тогда
		Возврат;
	КонецЕсли;	
	
	Ответственный 		= Пользователи.ТекущийПользователь();	
		
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);  	
	
	ДанныеШапки = ДанныеШапки();
	
	энргРаботаСТочкамиУчетаСервер.УстановитьИсториюСоглашенийОРаспределенииСверхнормативногоОДН(ДанныеШапки,Движения,"Услуги");
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
			
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеШапки()
		
	ДанныеШапки = Новый Структура;
	//ДанныеШапки.Вставить("Дата",				?(ЗначениеЗаполнено(ДатаФактическогоСобытия),КонецДня(ДатаФактическогоСобытия),Дата));
	ДанныеШапки.Вставить("Период",				?(ЗначениеЗаполнено(ДатаФактическогоСобытия),ДатаФактическогоСобытия,Дата));
	ДанныеШапки.Вставить("Район",				Район);
	ДанныеШапки.Вставить("Организация",			Организация); 
	ДанныеШапки.Вставить("ПериодРегистрации",	Дата);
	ДанныеШапки.Вставить("ПериодНачисления",	ПериодНачисления);  
	ДанныеШапки.Вставить("МКД",					МКД);
	ДанныеШапки.Вставить("Услуги",				Услуги);
	ДанныеШапки.Вставить("ИмяДокумента",		"энргСоглашениеОРаспределенииСверхнормативногоОДН");
	ДанныеШапки.Вставить("Документ",			Ссылка);
	Возврат ДанныеШапки;	

КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли
